module.exports.config = {
	name: "offbot",
	version: "3.9.0",
	hasPermssion: 2,
	credits: "yukihirasoma",
	description: "offbot",
	usePrefix: true,
  commandCategory: "system",
	cooldowns: 0
        };
module.exports.run = ({event, api}) =>api.sendMessage("╭──────•◈•───────╮\n         🄰🄻🅅🄸🄱🄾🅃       \n\nBYE BYE I love you ummmmmmmah,আসসালামু আলাইকুম🥰 আপনাদের সবার সাথে অনেক মজা করলাম যদি কোন ভুল হয়ে থাকে মাফ করে দিবেন😍🥰 বস  এর আদেশ আমি আর এখন কথা বলতে পারবো না😥 আপনাদের সাথে আমার আবার কথা হবে যখন আমার স্যার আলভী চৌধুরী অনুমতি দিবে😍 তাই এখন কার জন্য বিদায়...!💔\n\n  𝗠𝗥. 𝗔𝗟𝗩𝗜 𝗖𝗛𝗢𝗪𝗗𝗛𝗨𝗥𝗬\n╰──────•◈•───────╯",event.threadID, () =>process.exit(0))